zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1012SG01048.atdf
      <value-group name="CTRLA__SWRST">
        <value name="LOW" caption="No reset in progress" value="0x0"/>
        <value name="HIGH" caption="Reseting the registers and EIP" value="0x1"/>
      </value-group>
      <value-group name="CTRLA__RUNSTDBY">
        <value name="LOW" caption="Module is disabled in Standby Sleep mode" value="0x0"/>
        <value name="HIGH" caption="Module continues to run in Standby Sleep mode" value="0x1"/>
      </value-group>
      <value-group name="INTENCLR__SQI">
        <value name="LOW" caption="Interrupt Enabled" value="0x0"/>
        <value name="HIGH" caption="Interrupt Disabled" value="0x1"/>
      </value-group>
      <value-group name="INTENSET__SQI">
        <value name="LOW" caption="Interrupt disabled" value="0x0"/>
        <value name="HIGH" caption="Interrupt enabled" value="0x1"/>
      </value-group>
      <value-group name="SYNCBUSY__SWRST">
        <value name="LOW" caption="SWRST synchronization is not busy" value="0x0"/>
        <value name="HIGH" caption="SWRST synchronization is busy" value="0x1"/>
      </value-group>
    </module>
    <module name="SUPC" id="03926" name2="pwr_rpmu_supc_v1" version="1b0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt Enable" mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="ULDORDY" caption="User LDO Regulator Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="ULDOOVHEAT" caption="User LDO Regulator OverHeat Interrupt Enable" mask="0x8"/>
          <bitfield name="BORVDDIOB" caption="BORVDDIOB Interrupt Enable" mask="0x10"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt Enable" mask="0x20"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt Enable" mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="ULDORDY" caption="User LDO Regulator Ready Interrupt Enable" mask="0x4"/>
          <bitfield name="ULDOOVHEAT" caption="User LDO Regulator OverHeat Interrupt Enable" mask="0x8"/>
          <bitfield name="BORVDDIOB" caption="BORVDDIOB Interrupt Enable" mask="0x10"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt Enable" mask="0x20"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt Enable" mask="0x100"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="LVDET" caption="Low Voltage Detector Interrupt. Set to one if VDDIO crosses the treshold voltage in the good direction according to LVD.DIR." mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Interrupt. Set to one if LVD is ready to operate." mask="0x2"/>
          <bitfield name="ULDORDY" caption="User LDO Regulator Ready Interrupt. Set to one if ULDO is ready meaning that output voltage is correct." mask="0x4"/>
          <bitfield name="ULDOOVHEAT" caption="User LDO Regulator OverHeat Interrupt. Is set to one if overheat condition is detected." mask="0x8"/>
          <bitfield name="BORVDDIOB" caption="BORVDDIOB Interrupt. Set to one if VDDIOB issue is detected." mask="0x10"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Interrupt. Set to one if VDDUSB issue is detected." mask="0x20"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Interrupt. Set to one if additionnal regulator is ready meaning that output voltage is correct." mask="0x100"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Flag status">
          <bitfield name="LVDET" caption="Low Voltage Detector Status." mask="0x1"/>
          <bitfield name="LVDRDY" caption="Low Voltage Detector Ready Status" mask="0x2"/>
          <bitfield name="ULDORDY" caption="User LDO regulator Status. It corresponds to vreg_ready_mv signal from ULDO." mask="0x4"/>
          <bitfield name="ULDOOVHEAT" caption="User LDO Regulator OverHeat Status. It corresponds to vreg_overheat_event_mv signal from ULDO." mask="0x8"/>
          <bitfield name="BORVDDIOB" caption="BORVDDIOB Status. One if VDDIOB is OK. It corresponds to bor_vddiob_mv signal of SMOR." mask="0x10"/>
          <bitfield name="BORVDDUSB" caption="BORVDDUSB Status. One if VDDUSB is OK. It corresponds to bor_vddusb_n_mv signal of SMOR." mask="0x20"/>
          <bitfield name="ADDVREGRDY0" caption="Additional Regulator ready 0 Status. One if voltage is OK. It corresponds to vreg_ready_mv signal of additional regulator." mask="0x100"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronisation Busy">
          <bitfield name="BOR" caption="BOR Synchronization Busy" mask="0x1"/>
        </register>
        <register name="BOR" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="BOR Control">
          <bitfield name="ACTION" caption="Action when Threshold Crossed" mask="0x1" values="BOR__ACTION"/>
          <bitfield name="DCBORPSEL" caption="Duty Cycle BOR Prescaler Select" mask="0x70" values="BOR__DCBORPSEL"/>
          <bitfield name="BORFILT" caption="BOR filtering" mask="0x300" values="BOR__BORFILT"/>
        </register>
        <register name="LVD" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="LVD Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="DIR" caption="Direction" mask="0x4" values="LVD__DIR"/>
          <bitfield name="OEVEN" caption="Output Event Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x10"/>
          <bitfield name="LEVEL" caption="Threshold Level. See &quot;pwr_smor_[nn]_v1 DOS&quot; - level section to get details." mask="0xF0000"/>
        </register>
